johnny9/ESP-Miner-Bonanza/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=2048
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_WIFI_11KV_SUPPORT=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_LOG_COLORS=y
# Compile DEBUG statements into release firmware while retaining INFO as the
# boot default. AxeOS can then change the runtime level without reflashing.
# CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT is not set
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LWIP_MAX_SOCKETS=26
CONFIG_LWIP_IPV6=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_USE_ESP_GETADDRINFO=y
CONFIG_SPIFFS_OBJ_NAME_LEN=64
CONFIG_LV_CONF_SKIP=n
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64=y
# Board 1002 uses the ESP32-S3 default UART0 pins (GPIO43/44) for the
# Bonanza RP2040 safety bridge. Keep all IDF console traffic off that link.
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_USB_CDC is not set
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set
# CONFIG_ESP_CONSOLE_NONE is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
CONFIG_BZM_1002_PROOF_TIMEOUT_SECONDS=90
CONFIG_BZM_1002_RESULT_RECOVERY_TIMEOUT_MS=5000
CONFIG_BZM_1002_MIN_VALID_RESULTS=1
CONFIG_BZM_1002_MAX_LOCAL_REJECTIONS=16
CONFIG_BZM_1002_MAX_MAPPING_REJECTIONS=16
CONFIG_BZM_1002_MIN_NONCE_DIFFICULTY=16
CONFIG_BZM_1002_LEAD_ZEROS=36
CONFIG_BZM_1002_DISPATCH_GAP_US=250
CONFIG_BZM_1002_PARSER_REALIGN_MAX_DISCARDS=256
CONFIG_BZM_1002_PARSER_REALIGN_CLEAN_WINDOWS=2
CONFIG_BZM_1002_PARSER_REALIGN_MAX_WINDOWS=20
CONFIG_BZM_1002_PARSER_REALIGN_MAX_EVENTS=20
CONFIG_BZM_1002_FAN_MIN_PERCENT=36
CONFIG_BZM_1002_SAFE_OFF_VCORE_MV=250
CONFIG_BZM_1002_TELEMETRY_MAX_AGE_MS=2000
CONFIG_BZM_1002_SENSOR_TDM_GAP_COUNT=63
CONFIG_BZM_1002_TEMP_MIN_C=-20
CONFIG_BZM_1002_TEMP_MAX_C=75
CONFIG_BZM_1002_STACK_MV_MIN=300
CONFIG_BZM_1002_STACK_MV_MAX=800
CONFIG_BZM_1002_INTERSTACK_DIFF_ABS_MAX_MV=50
CONFIG_BZM_1002_CH2_CONFIRM_SAMPLES=3
CONFIG_BZM_1002_PLL_LOCK_CONFIRM_SAMPLES=3
CONFIG_BZM_1002_STACK_MAX_SPREAD_MV=100
